__author__ = 'zloy'

#количество групп в расписаниях для каждого курса
kurses_size = {'1':19, '2':12, '3':11, '4':10, '5':7, 'mag':11}

#имена преподователей в полном и сокращенном виде
names = {
            'Шумейко И.П.':('Шумейко','Шумейк.','Шумейко.'),
            'Староселецкая Н.Н.':('Старосел.','Староселецк.','Староселец.','Староселецкая','Староселецкая.','Старос.','Старос'),
            'Черненькая В.П.':('Черненьк.','Чернен.','Черн.','Черненькая','Черненькая.','Черн.В.','Черн'),
            'Куликова Е.В.':('Куликова','Куликов.','Куликова.','Куликова.','Кулик'),
            'Дымченко И.В.':('Дымченк.','Дымченко','Дымчен.','Дымчен'),
            'Плескачёва О.А.':('Плескачёва','Плескачева','Плескач.','Плескачев.','Плескачёв','Плеск.'),
            'Гончаренко Ю.Ю.':('Гон.Ю.','Гончар.Ю.','Гончаренко  Ю.'),
            'Гончаренко Д.Г.':('Гон.Д.','Гончар.Д.'),
            'Лагуткина Т.В.':('Лагутк.','Лагуткина'),
            'Волкова А.В.':('Волк.','Волков.','Волкова'),
            'Ожиганова М.И.':('Ожиган.','Ожиганова.','Ожиганова'),
            'Смычков Е.Е.':('Смычков','Смычков.,Смычк.'),
            'Костюков А.Д.':('Костюков.','Костюков','Костюк.'),
            'Шахайда В.М.':('Шахайда','Шахайда.','Шахайд.'),
            'Артеменко М.А.':('Артем.','Артеменко','Артемен.'),
            'Лебеденко А.В.':('Лебеден.','Лебеденко','Лебед.','Гон.Леб.'),
            'Шилин В.В.':('Шилин.','Шилин'),
            'Скороход М.Ю.':('Скороход','Скорох.','Скороход.','Скороход'),
         }
